############################################################################
#                                    Tap                                   #
############################################################################
tap "homebrew/bundle"
tap "homebrew/services"
tap "mhaeuser/mhaeuser"



############################################################################
#                               Formulas                                   #
############################################################################
brew "git"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "starship" #terminal prompt
brew "neovim" #code editor
brew "gcc" #C/C++ compiler
brew "python"
brew "lua"
brew "node@22" # LTS version
brew "cmake" #build tool for C/C++
brew "criterion" #unit testing library for C/C++
brew "superfile" #file manager
brew "postgresql@17", restart_service: true, link: true
brew "wget" # Internet file retriever
brew "git-delta" #better git diff
brew "eza" #better ls
brew "tlrc" #short man page
brew "zoxide" #better cd
brew "fzf" 
brew "battery-toolkit" # Battery controller
	# BatFi hidden free download link: https://files.micropixels.software/batfi/BatFi-latest.zip
	# cask "aldente"

echo "source $(brew --prefix)/share/.zsh-autosuggestions/zsh-autosuggestions.zsh" >> ~/.zshrc

#############################################################################
#                                   Apps                                    #
#############################################################################
# PDFGear: best pdf tool  https://www.pdfgear.com/
# Horo: best minimalist timer & countdown

# temporary place for drag and drop files
	# Folder Hub: has better shortcuts
	# cask "dropzone"

cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-cairo"
cask "wezterm" #terminal of choice
cask "arc" #browser
cask "bitwarden" #Password Manager
cask "ente-auth" #2FA app
cask "raycast" #better spotlight w/ app launcher and window manager
cask "todoist" #task manager
cask "morgen" #calendar
cask "anaconda" #python envirnments manager
cask "temurin@21" #Best OpenJDK right now
cask "intellij-idea-ce"
cask "visual-studio-code"
cask "free-download-manager"
cask "obsidian" #markdown notetaking app
# cask "aerospace" #i3-like tiling+window manager
# cask "jordanbaird-ice" #hide menu bar apps
cask "tempbox" #temporary emails
cask "telegram" #native macOS telegram app
# cask "telegram-desktop" #non-native app with additional features
cask "whatsapp"
cask "elmedia-player" #media player
cask "shottr" #better screenshots
cask "4k-video-downloader+" #video downloader
cask "time-out" #sceen-eye breaks
cask "grammarly-desktop"
# cask "chatgpt" 
cask "keka" #archiver
cask "appcleaner" #better uninstaller
cask "vmware-fusion"
cask "utm" #another VM
cask "docker"



#############################################################################
#                              VS Code Plugins                              #
#############################################################################
vscode "adpyke.codesnap"
vscode "asvetliakov.vscode-neovim"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "ecmel.vscode-html-css"
vscode "formulahendry.code-runner"
vscode "hediet.vscode-drawio"
vscode "hnw.vscode-auto-open-markdown-preview"
vscode "monish.regexsnippets"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.live-server"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-arabic"
vscode "streetsidesoftware.code-spell-checker-french"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"
vscode "usernamehw.errorlens"
vscode "vexrobotics.vexcode"
vscode "vexrobotics.vexfeedback"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wayou.vscode-todo-highlight"
vscode "wix.vscode-import-cost"
vscode "wware.snippet-creator"